Tekla.Structures.AnalysisInternal.AnalysisModuleManager
Analysis Module Manager to check configuration against Insert/Modify commands.

Tekla.Structures.AnalysisInternal.AnalysisModuleManager.CheckModules(Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum)
Checks current module configuration against Modify/Modify command.
Type: Analysis Object Type.
Throws System.MethodAccessException: Cast an exception if operation is not allowed.